algorithm/cache/LRU.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>LRU.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/algorithm/cache">Up: cache</a>
	  	
	</span>

	<span id="next">
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="overview">Overview</h1>
<p>LRU stands for <em>least recently used</em>. LRUCache is a fixed-capacity key-value store that will evict oldest items when full and set new keys.</p>
<p>When read item from LRUCache, the key is moved to the front of the underlying list to the most recently used item.</p>
<h1 id="implement">Implement</h1>
<p>Refer the source code of <a href="https://github.com/golang/groupcache/blob/master/lru/lru.go">https://github.com/golang/groupcache/blob/master/lru/lru.go</a></p>
<p>LRUCache is consist up by</p>
<ol class="incremental">
<li>hash map</li>
<li>double linked list (order by the timestamp of used, both write and read)</li>
<li>capacity setting</li>
</ol>
<p>Add element and value</p>
<ol class="incremental">
<li>check if the element has been added into hash map. If yes, bring the item to the front of the linked list</li>
<li>else add element to hash map and create new item to the front of the linked list</li>
</ol>
<p>Get element by key</p>
<ol class="incremental">
<li>if the key is exist in hash map, bring the item to the front of the linked list, and then return the value</li>
</ol>
<h1 id="code">Code</h1>
<p>Solution of <a href="https://leetcode.com/problems/lru-cache/">Leetcode 146</a></p>
<div class="sourceCode" id="cb1" data-results="output"><pre class="sourceCode go"><code class="sourceCode go"><span id="cb1-1"><a href="#cb1-1"></a><span class="kw">import</span> <span class="st">&quot;container/list&quot;</span></span>
<span id="cb1-2"><a href="#cb1-2"></a></span>
<span id="cb1-3"><a href="#cb1-3"></a><span class="kw">type</span> LRUCache <span class="kw">struct</span> {</span>
<span id="cb1-4"><a href="#cb1-4"></a>        Capacity <span class="dt">int</span></span>
<span id="cb1-5"><a href="#cb1-5"></a>        cache <span class="kw">map</span>[<span class="dt">int</span>]*list.Element</span>
<span id="cb1-6"><a href="#cb1-6"></a>        ll *list.List</span>
<span id="cb1-7"><a href="#cb1-7"></a>}</span>
<span id="cb1-8"><a href="#cb1-8"></a></span>
<span id="cb1-9"><a href="#cb1-9"></a><span class="kw">type</span> entry <span class="kw">struct</span> {</span>
<span id="cb1-10"><a href="#cb1-10"></a>        key <span class="dt">int</span></span>
<span id="cb1-11"><a href="#cb1-11"></a>        value <span class="dt">int</span></span>
<span id="cb1-12"><a href="#cb1-12"></a>}</span>
<span id="cb1-13"><a href="#cb1-13"></a></span>
<span id="cb1-14"><a href="#cb1-14"></a><span class="kw">func</span> Constructor(capacity <span class="dt">int</span>) LRUCache {</span>
<span id="cb1-15"><a href="#cb1-15"></a>        <span class="kw">return</span> LRUCache{</span>
<span id="cb1-16"><a href="#cb1-16"></a>                Capacity: capacity,</span>
<span id="cb1-17"><a href="#cb1-17"></a>                cache: <span class="bu">make</span>(<span class="kw">map</span>[<span class="dt">int</span>]*list.Element),</span>
<span id="cb1-18"><a href="#cb1-18"></a>                ll: list.New(),</span>
<span id="cb1-19"><a href="#cb1-19"></a>        }</span>
<span id="cb1-20"><a href="#cb1-20"></a>}</span>
<span id="cb1-21"><a href="#cb1-21"></a></span>
<span id="cb1-22"><a href="#cb1-22"></a><span class="kw">func</span> (this *LRUCache) Get(key <span class="dt">int</span>) <span class="dt">int</span> {</span>
<span id="cb1-23"><a href="#cb1-23"></a>        <span class="kw">if</span> e, ok := this.cache[key]; ok {</span>
<span id="cb1-24"><a href="#cb1-24"></a>                this.ll.MoveToFront(e)</span>
<span id="cb1-25"><a href="#cb1-25"></a>                <span class="kw">return</span> e.Value.(*entry).value</span>
<span id="cb1-26"><a href="#cb1-26"></a></span>
<span id="cb1-27"><a href="#cb1-27"></a>        }</span>
<span id="cb1-28"><a href="#cb1-28"></a>        <span class="kw">return</span> <span class="dv">-1</span></span>
<span id="cb1-29"><a href="#cb1-29"></a>}</span>
<span id="cb1-30"><a href="#cb1-30"></a></span>
<span id="cb1-31"><a href="#cb1-31"></a></span>
<span id="cb1-32"><a href="#cb1-32"></a><span class="kw">func</span> (this *LRUCache) Put(key <span class="dt">int</span>, value <span class="dt">int</span>)  {</span>
<span id="cb1-33"><a href="#cb1-33"></a>        <span class="kw">if</span> e, ok := this.cache[key]; ok {</span>
<span id="cb1-34"><a href="#cb1-34"></a>                e.Value.(*entry).value = value</span>
<span id="cb1-35"><a href="#cb1-35"></a>                this.ll.MoveToFront(e)</span>
<span id="cb1-36"><a href="#cb1-36"></a>                <span class="kw">return</span></span>
<span id="cb1-37"><a href="#cb1-37"></a>        }</span>
<span id="cb1-38"><a href="#cb1-38"></a></span>
<span id="cb1-39"><a href="#cb1-39"></a>        e := this.ll.PushFront(&amp;entry{key, value})</span>
<span id="cb1-40"><a href="#cb1-40"></a>        this.cache[key] = e     </span>
<span id="cb1-41"><a href="#cb1-41"></a></span>
<span id="cb1-42"><a href="#cb1-42"></a>        <span class="kw">if</span> this.ll.Len() &gt; this.Capacity {</span>
<span id="cb1-43"><a href="#cb1-43"></a>                leastRecent := this.ll.Back()</span>
<span id="cb1-44"><a href="#cb1-44"></a>                <span class="bu">delete</span>(this.cache, leastRecent.Value.(*entry).key)</span>
<span id="cb1-45"><a href="#cb1-45"></a>                this.ll.Remove(leastRecent)</span>
<span id="cb1-46"><a href="#cb1-46"></a>        }</span>
<span id="cb1-47"><a href="#cb1-47"></a>        <span class="kw">return</span></span>
<span id="cb1-48"><a href="#cb1-48"></a>}</span>
<span id="cb1-49"><a href="#cb1-49"></a></span>
<span id="cb1-50"><a href="#cb1-50"></a></span>
<span id="cb1-51"><a href="#cb1-51"></a><span class="kw">func</span> main() {</span>
<span id="cb1-52"><a href="#cb1-52"></a>        lru := Constructor(<span class="dv">2</span>)</span>
<span id="cb1-53"><a href="#cb1-53"></a>        lru.Put(<span class="dv">1</span>,<span class="dv">1</span>)</span>
<span id="cb1-54"><a href="#cb1-54"></a>        lru.Put(<span class="dv">2</span>,<span class="dv">2</span>)</span>
<span id="cb1-55"><a href="#cb1-55"></a>        <span class="kw">if</span> lru.Get(<span class="dv">1</span>) != <span class="dv">1</span> {</span>
<span id="cb1-56"><a href="#cb1-56"></a>                <span class="bu">panic</span>(<span class="st">&quot;must be 1&quot;</span>)</span>
<span id="cb1-57"><a href="#cb1-57"></a>        }</span>
<span id="cb1-58"><a href="#cb1-58"></a></span>
<span id="cb1-59"><a href="#cb1-59"></a>        lru.Put(<span class="dv">3</span>,<span class="dv">3</span>)</span>
<span id="cb1-60"><a href="#cb1-60"></a>        <span class="kw">if</span> lru.Get(<span class="dv">2</span>) != <span class="dv">-1</span> {</span>
<span id="cb1-61"><a href="#cb1-61"></a>                <span class="bu">panic</span>(<span class="st">&quot;must be -1&quot;</span>)</span>
<span id="cb1-62"><a href="#cb1-62"></a>        }</span>
<span id="cb1-63"><a href="#cb1-63"></a></span>
<span id="cb1-64"><a href="#cb1-64"></a>        lru.Put(<span class="dv">4</span>,<span class="dv">4</span>)</span>
<span id="cb1-65"><a href="#cb1-65"></a>        <span class="kw">if</span> lru.Get(<span class="dv">1</span>) != <span class="dv">-1</span> {</span>
<span id="cb1-66"><a href="#cb1-66"></a>                <span class="bu">panic</span>(<span class="st">&quot;must be -1&quot;</span>)</span>
<span id="cb1-67"><a href="#cb1-67"></a>        }</span>
<span id="cb1-68"><a href="#cb1-68"></a></span>
<span id="cb1-69"><a href="#cb1-69"></a>        <span class="kw">if</span> lru.Get(<span class="dv">3</span>) != <span class="dv">3</span> {</span>
<span id="cb1-70"><a href="#cb1-70"></a>                <span class="bu">panic</span>(<span class="st">&quot;must be 3&quot;</span>)</span>
<span id="cb1-71"><a href="#cb1-71"></a>        }</span>
<span id="cb1-72"><a href="#cb1-72"></a></span>
<span id="cb1-73"><a href="#cb1-73"></a>        <span class="kw">if</span> lru.Get(<span class="dv">4</span>) != <span class="dv">4</span> {</span>
<span id="cb1-74"><a href="#cb1-74"></a>                <span class="bu">panic</span>(<span class="st">&quot;must be 4&quot;</span>)</span>
<span id="cb1-75"><a href="#cb1-75"></a>        }</span>
<span id="cb1-76"><a href="#cb1-76"></a>}</span>
<span id="cb1-77"><a href="#cb1-77"></a></span></code></pre></div>
<h1 id="reference">Reference</h1>
<ul class="incremental">
<li><a href="https://yomguithereal.github.io/mnemonist/lru-cache.html">Mnemonist – LRU Cache</a></li>
<li><a href="https://en.wikipedia.org/wiki/Cache_replacement_policies#Least_recently_used_(LRU)">Least recently used – wikipedia</a></li>
<li><a href="https://github.com/golang/groupcache/blob/master/lru/lru.go">https://github.com/golang/groupcache/blob/master/lru/lru.go</a></li>
</ul>

      </div>
    </section>
  </body>
</html>
